tests/wiremock/files/shopper-response.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
    <soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
        <snp:GetShopperIdByDomainName xmlns:snp="urn:RegDBWebSvcService">
            <ResultsXML>
                &lt;GetShopperIdByDomainName&gt;
                    &lt;RECORDSET&gt;
                        &lt;RECORD&gt;
                        {{#assign 'domainRequested'}}{{xPath request.body '//DomainName[1]/text()'}}{{/assign}}
                        {{regexExtract domainRequested '^stub(registered|foreign)(\d{9}|random)(\d{9}|random)(diablo|gocentral|mwpone|foreign)(\d{9}|random)([0-9A-Fa-f]{12}|random)-.*\.com$' 'fields'}}
                            &lt;SHOPPER_ID&gt;{{#if (eq fields.1 'random')}}{{randomValue length=9 type='NUMERIC'}}{{else}}{{fields.1}}{{/if}}&lt;/SHOPPER_ID&gt;
                        &lt;/RECORD&gt;
                    &lt;/RECORDSET&gt;
                &lt;/GetShopperIdByDomainName&gt;
            </ResultsXML>
        </snp:GetShopperIdByDomainName>
    </soap:Body>
</soap:Envelope>